{"ingredients": [{"dimension": "Cup", "name": "French Green Lentils", "number": "1"}, {"dimension": "Cloves", "name": "Garlic", "number": "4"}, {"dimension": "Bunch", "name": "Asparagus", "number": "1"}, {"dimension": "", "name": " Fennel Bulb", "number": "1"}, {"dimension": "", "name": "Lemon", "number": "1"}, {"dimension": "", "name": "Yellow Onion", "number": "1"}, {"dimension": "Bunch", "name": "Chives", "number": "1"}, {"dimension": "Tablespoons", "name": "Tomato Paste", "number": "2"}, {"dimension": "", "name": " Cup Mayonnaise", "number": "¼"}, {"dimension": "", "name": " Cup Rice Flour", "number": "¼"}, {"dimension": "", "name": " Teaspoons Lentil Minestra Spice Blend (Ground Coriander, Sweet Paprika & Garlic Powder)", "number": "2"}], "steps": [{"text": "Wash and dry the fresh produce. Cut off and discard any fennel stems; small dice the bulb. Peel and small dice the onion. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Quarter and deseed the lemon. Snap off and discard the tough, woody ends of the asparagus. Cut off and reserve the top 3 inches of each asparagus stalk; thinly slice the remaining stalks crosswise. Cut the chives into ½-inch pieces.", "order": 1, "title": "Prepare the ingredients:"}, {"text": "In a large pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the fennel, onion, spice blend and ¾ of the garlic paste; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened and fragrant. Add the tomato paste and cook, stirring frequently, 2 to 3 minutes, or until dark red and fragrant.", "order": 2, "title": "Start the minestra:"}, {"text": "Add the lentils and 4 cups of water to the pot; season with salt and pepper. Heat to boiling on high. Reduce the heat to medium-high; simmer, stirring occasionally, 24 to 26 minutes, or until thickened and the lentils are tender. Stir in the sliced asparagus and the juice of the remaining lemon wedges. Remove from heat; season with salt and pepper to taste. Let stand for 2 minutes.", "order": 3, "title": "Finish the minestra:"}, {"text": "While the lentils simmer, in a bowl, combine the mayonnaise, remaining garlic paste and the juice of 2 lemon wedges; season with salt and pepper to taste.", "order": 4, "title": "Make the aioli:"}, {"text": "While the lentils continue to simmer, in a large bowl, whisk together the rice flour and 5 tablespoons of water to create a thin batter; season with salt and pepper. In a medium pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Working in batches, coat the asparagus tops in the batter (letting any excess drip off). Once the oil is hot enough that a drop of batter sizzles immediately when added to the pan, carefully add the coated asparagus. Cook, flipping halfway through, 3 to 5 minutes, or until golden and crispy. Transfer to a paper towel-lined plate; immediately season with salt and pepper.", "order": 5, "title": "Make the asparagus tempura:"}, {"text": "Divide the finished minestra between 2 bowls. Top with the asparagus tempura. Garnish with the chives. Serve with the aioli on the side. Enjoy!", "order": 6, "title": "Plate your dish:"}], "metadata": {"subtitle": "with Asparagus Tempura & Lemon Aioli", "title": "Lentil & Fennel Minestra ", "overview": "A classic vegetable soup (and minestrone’s culinary ancestor), minestra is delicious, rustic Italian fare. In this recipe, we’re making the dish with French green lentils, stewed with anise-like fennel and warm spices. For an exciting, seasonal addition, we’re tempura-frying springtime asparagus (coating the stalks in rice flour batter and lightly frying them on the stove) as a crunchy, flavorful garnish.", "calories": 700, "cookTime": 45, "servings": 2}}