{"ingredients": [{"dimension": "", "name": " Cod Fillets", "number": "2"}, {"dimension": "", "name": " Farm Eggs", "number": "2"}, {"dimension": "Cup", "name": "Basmati Rice", "number": "½"}, {"dimension": "", "name": "Yellow Onion", "number": "1"}, {"dimension": "", "name": "Lime", "number": "1"}, {"dimension": "Pound", "name": "Green Cabbage", "number": "½"}, {"dimension": "", "name": "1-Inch Piece Ginger", "number": "1"}, {"dimension": "Cup", "name": "All-Purpose Flour", "number": "¼"}, {"dimension": "Teaspoons", "name": "Kedgeree Spice Blend (Ground Fenugreek, Ground Fennel Seed, Ground Coriander, Ground Ginger & Garlic Powder)", "number": "2"}], "steps": [{"text": "In a small pot, combine the rice, a big pinch of salt and 1¼ cups of water; heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork.", "order": 1, "title": "Cook the rice: "}, {"text": "While the rice cooks, wash and dry the fresh produce. Cut out and discard the cabbage core; thinly slice the leaves. Peel, halve and thinly slice the onion. Peel and mince the ginger. Using a peeler, remove the green rind of the lime, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter the lime. Crack the eggs into a bowl; beat until smooth.", "order": 2, "title": "Prepare the ingredients: "}, {"text": "While the rice continues to cook, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the cabbage; season with salt and pepper. Cook, stirring frequently, 2 to 4 minutes, or until wilted. Transfer to a bowl and set aside in a warm place. Wipe out the pan.", "order": 3, "title": "Cook the cabbage: "}, {"text": "Pat the cod dry with paper towels; season with salt and pepper on both sides. In the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned cod and cook 2 to 3 minutes per side, or until lightly browned and cooked through. Transfer to a plate. Using 2 forks, carefully flake the cooked cod into bite-sized pieces. Rinse and wipe out the pan.", "order": 4, "title": "Cook & flake the cod: "}, {"text": "In a medium bowl, combine the onion and flour; toss to coat. In the pan used to cook the cod, heat a thin layer of oil on medium-high until hot. Add the coated onion (tapping off any excess flour) in a single layer and cook, stirring frequently, 3 to 5 minutes, or until browned and crispy. Transfer to a paper towel-lined plate; immediately season with salt and pepper. Carefully discard the oil and wipe out the pan.", "order": 5, "title": "Make the frizzled onion: "}, {"text": "In the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the ginger and cook, stirring occasionally, 30 seconds to 1 minute, or until fragrant. Add the eggs; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until just cooked through. Add the cooked rice, cooked cabbage, flaked cod, spice blend, lime zest and the juice of 2 lime wedges. Cook, stirring occasionally, 2 to 3 minutes, or until thoroughly combined and heated through; season with salt and pepper to taste. Divide between 2 dishes. Garnish with the frizzled onion and remaining lime wedges. Enjoy!", "order": 6, "title": "Finish & plate your dish: "}], "metadata": {"subtitle": "with Basmati Rice, Eggs & Frizzled Onion ", "title": "Cod Kedgeree ", "overview": "Kedgeree, a popular breakfast option in England, is comforting, casual fare at its finest. Adapted from an Indian dish of spiced lentils and rice, kedgeree substitutes the lentils with ingredients like flaked fish and eggs. For dinner tonight, we’re seasoning our hearty stir-fry with a blend of warm curry spices, including ground fenugreek and coriander. We’re garnishing each bowl with lime wedges and—for satisfyingly crispy texture—lightly dredged and pan-fried onion.", "calories": 600, "cookTime": 40, "servings": 2}}