{"ingredients": [{"dimension": "Count", "name": " Cod Fillets", "quantity": 2}, {"dimension": "Count", "name": " Farm Eggs", "quantity": 2}, {"dimension": "Cup", "name": "Basmati Rice", "quantity": 0.5}, {"dimension": "Count", "name": "Yellow Onion", "quantity": 1}, {"dimension": "Count", "name": "Lime", "quantity": 1}, {"dimension": "Pound", "name": "Green Cabbage", "quantity": 0.5}, {"dimension": "Count", "name": "1-Inch Piece Ginger", "quantity": 1}, {"dimension": "Cup", "name": "All-Purpose Flour", "quantity": 0.25}, {"dimension": "Teaspoons", "name": "Kedgeree Spice Blend (Ground Fenugreek, Ground Fennel Seed, Ground Coriander, Ground Ginger and Garlic Powder)", "quantity": 2}], "steps": [{"index": 1, "text": "In a small pot, combine the rice, a big pinch of salt and 11 degrees 4 cups of water; heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork.", "title": "Cook the rice "}, {"index": 2, "text": "While the rice cooks, wash and dry the fresh produce. Cut out and discard the cabbage core; thinly slice the leaves. Peel, halve and thinly slice the onion. Peel and mince the ginger. Using a peeler, remove the green rind of the lime, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter the lime. Crack the eggs into a bowl; beat until smooth.", "title": "Prepare the ingredients "}, {"index": 3, "text": "While the rice continues to cook, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the cabbage; season with salt and pepper. Cook, stirring frequently, 2 to 4 minutes, or until wilted. Transfer to a bowl and set aside in a warm place. Wipe out the pan.", "title": "Cook the cabbage "}, {"index": 4, "text": "Pat the cod dry with paper towels; season with salt and pepper on both sides. In the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned cod and cook 2 to 3 minutes per side, or until lightly browned and cooked through. Transfer to a plate. Using 2 forks, carefully flake the cooked cod into bite-sized pieces. Rinse and wipe out the pan.", "title": "Cook and flake the cod "}, {"index": 5, "text": "In a medium bowl, combine the onion and flour; toss to coat. In the pan used to cook the cod, heat a thin layer of oil on medium-high until hot. Add the coated onion (tapping off any excess flour) in a single layer and cook, stirring frequently, 3 to 5 minutes, or until browned and crispy. Transfer to a paper towel-lined plate; immediately season with salt and pepper. Carefully discard the oil and wipe out the pan.", "title": "Make the frizzled onion "}, {"index": 6, "text": "In the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the ginger and cook, stirring occasionally, 30 seconds to 1 minute, or until fragrant. Add the eggs; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until just cooked through. Add the cooked rice, cooked cabbage, flaked cod, spice blend, lime zest and the juice of 2 lime wedges. Cook, stirring occasionally, 2 to 3 minutes, or until thoroughly combined and heated through; season with salt and pepper to taste. Divide between 2 dishes. Garnish with the frizzled onion and remaining lime wedges. Enjoy!", "title": "Finish and plate your dish "}], "metadata": {"subtitle": "with Basmati Rice, Eggs and Frizzled Onion ", "title": "Cod Kedgeree ", "URL": "https://www.blueapron.com/recipes/cod-kedgeree-with-basmati-rice-eggs-frizzled-onion", "overview": "Kedgeree, a popular breakfast option in England, is comforting, casual fare at its finest. Adapted from an Indian dish of spiced lentils and rice, kedgeree substitutes the lentils with ingredients like flaked fish and eggs. For dinner tonight, we're seasoning our hearty stir-fry with a blend of warm curry spices, including ground fenugreek and coriander. We're garnishing each bowl with lime wedges and - for satisfyingly crispy texture - lightly dredged and pan-fried onion.", "calories": 600, "cookTime": 40, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Boneless, Skin-On Chicken Breasts", "quantity": 2}, {"dimension": "Count", "name": " Ounces Fettuccine Pasta", "quantity": 6}, {"dimension": "Count", "name": "15-Ounce Can Crushed Tomatoes", "quantity": 1}, {"dimension": "Ounces", "name": "White Mushrooms", "quantity": 4}, {"dimension": "Cloves", "name": "Garlic", "quantity": 3}, {"dimension": "Tablespoons", "name": "Grated Parmesan Cheese", "quantity": 2}, {"dimension": "Tablespoon", "name": "Butter", "quantity": 1}, {"dimension": "Teaspoon", "name": "Crushed Red Pepper Flakes", "quantity": 0.25}], "steps": [{"index": 1, "text": "Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Cut the mushrooms into bite-sized pieces. Peel and mince the garlic.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Pat the chicken dry with paper towels; season with salt and pepper on both sides. In a large, high-sided pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned chicken, skin sides down; cook, loosely covering the pan with foil, 4 to 6 minutes per side, or until golden brown and cooked through. Transfer to a cutting board, leaving any browned bits (or fond) in the pan. Chop the cooked chicken into bite-sized pieces.", "title": "Cook and chop the chicken"}, {"index": 3, "text": "Heat the pan of reserved fond on medium-high until hot. (If the pan seems dry, add up to 2 teaspoons of olive oil.) Add the mushrooms and cook, stirring occasionally, 4 to 6 minutes, or until lightly browned and crispy. Add the garlic and as much of the red pepper flakes as you'd like, depending on how spicy you'd like the dish to be; season with salt and pepper. Cook, stirring occasionally, 30 seconds to 1 minute, or until fragrant. Add the crushed tomatoes and 1 degrees 2 cup of water; season with salt and pepper. Simmer, stirring occasionally, 6 to 8 minutes, or until thickened and slightly reduced in volume. Turn off the heat.", "title": "Make the sauce"}, {"index": 4, "text": "While the sauce simmers, add the pasta to the pot of boiling water and cook 8 to 10 minutes, or until al dente (still slightly firm to the bite). Reserving 1 degrees 2 cup of the pasta cooking water, drain thoroughly and rinse under warm water to prevent sticking.", "title": "Cook the pasta"}, {"index": 5, "text": "Add the chopped chicken, cooked pasta, butter and half the reserved pasta cooking water to the pan of sauce; season with salt and pepper. Cook on medium-high, stirring frequently, 2 to 3 minutes, or until thoroughly combined. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Season with salt and pepper to taste.", "title": "Finish the cacciatore"}, {"index": 6, "text": "Divide 2 degrees 3 of the finished cacciatore between 2 dishes (you will have extra cacciatore). Garnish with the cheese. Enjoy!", "title": "Plate your dish"}], "metadata": {"subtitle": "with Fettuccine Pasta and Mushrooms", "title": "Chicken Cacciatore", "URL": "https://www.blueapron.com/recipes/chicken-cacciatore-with-fettuccine-pasta-mushrooms", "overview": "Chicken cacciatore is a hallmark of Italian-American cuisine. In this recipe, we're tossing thick fettuccine with perfect bites of crispy-skinned chicken. As for the sauce itself, we're staying true to the classic ingredients - crushed tomatoes, sauteed mushrooms, garlic and a pinch of hot red pepper flakes. Topped off with a sprinkling of Parmesan, this dish is delicious comfort food with a sophisticated touch. (And we're sending you enough for leftovers!)", "calories": 575, "cookTime": 40, "servings": 3}}
{"ingredients": [{"dimension": "Count", "name": "Corn Tortillas", "quantity": 4}, {"dimension": "Ounces", "name": "Monterey Jack Cheese", "quantity": 4}, {"dimension": "Ounces", "name": "Mixed Mushrooms", "quantity": 6}, {"dimension": "Count", "name": "Radishes", "quantity": 3}, {"dimension": "Ounces", "name": "Baby Kale", "quantity": 2}, {"dimension": "Count", "name": "Avocado", "quantity": 1}, {"dimension": "Count", "name": "Lime", "quantity": 1}, {"dimension": "Count", "name": "Poblano Pepper", "quantity": 1}, {"dimension": "Bunch", "name": "Cilantro", "quantity": 1}, {"dimension": "Tablespoon", "name": "Mexican Spice Blend (Garlic Powder, Ancho Chile Powder, Smoked Paprika, Ground Cumin and Whole Mexican Oregano)", "quantity": 1}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Wash and dry the fresh produce. Stack the tortillas; cover with a damp paper towel. Thinly slice the cremini mushrooms; tear the oyster and maitake mushrooms into bite-sized pieces. Small dice the radishes. Pick the cilantro leaves off the stems; discard the stems. Grate the cheese. Quarter the lime. Pit, peel and small dice the avocado; toss with the juice of 1 lime wedge. Halve the poblano pepper lengthwise; remove and discard the stem, ribs and seeds, then thoroughly wash your hands.", "title": "Prepare the ingredients  "}, {"index": 2, "text": "Place the poblano pepper on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single layer, cut sides down, and roast 18 to 20 minutes, or until slightly charred and tender. Remove from the oven and transfer to a cutting board. When cool enough to handle, finely chop the roasted poblano pepper.", "title": "Roast and chop the poblano pepper"}, {"index": 3, "text": "While the poblano pepper roasts, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the mixed mushrooms and cook, stirring occasionally, 6 to 8 minutes, or until browned and crispy. Add the spice blend and season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until fragrant. Transfer to a medium bowl; immediately season with salt and pepper. Wipe out the pan.", "title": "Cook the mushrooms "}, {"index": 4, "text": "While the poblano pepper continues to roast, in the pan used to cook the mushrooms, heat 2 teaspoons of olive oil on medium-high until hot. Add the kale; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until wilted. Transfer to the bowl of cooked mushrooms. Wipe out the pan. ", "title": "Cook the kale "}, {"index": 5, "text": "To make the filling, to the bowl of cooked mushrooms and kale, add as much of the chopped poblano pepper as you'd like, depending on how spicy you'd like the dish to be. Stir to thoroughly combine; season with salt and pepper to taste. Place the tortillas on a clean, dry work surface. Divide half the cheese between 2 of the tortillas; top with the filling, then the remaining cheese. Complete the quesadillas with the remaining tortillas.", "title": "Assemble the quesadillas "}, {"index": 6, "text": "In the pan used to cook the kale, heat 2 teaspoons of olive oil on medium-high until hot. Add the quesadillas and cook 2 to 4 minutes per side, or until the tortillas are crispy and the cheese has melted. Divide between 2 plates. While the quesadillas cook, in a bowl, combine the avocado, radishes and the juice of the remaining lime wedges. Drizzle with olive oil; season with salt and pepper to taste. Top the cooked quesadillas with the avocado-radish salsa. Garnish with the cilantro. Enjoy!", "title": "Finish and plate your dish "}], "metadata": {"subtitle": "with Monterey Jack Cheese and Avocado-Radish Salsa", "title": "Mushroom and Poblano Pepper Quesadillas", "URL": "https://www.blueapron.com/recipes/mushroom-poblano-pepper-quesadillas-with-queso-oaxaca-avocado-radish-salsa", "overview": "These gourmet quesadillas are layered with three kinds of mushrooms (button-topped cremini, and ruffled oyster and maitake), creamy Monterey Jack cheese and plenty of vegetables - including a roasted poblano pepper. (Though most are mild, some poblano peppers are relatively hot. So be sure to wash your hands right after handling the pepper, and use only as much of it as you'd like!) A fresh salsa of creamy avocado, crunchy radishes and cilantro completes the quesadillas with delicious texture.", "calories": 690, "cookTime": 40, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Farm Eggs", "quantity": 2}, {"dimension": "Pound", "name": "Fresh Ramen Noodles", "quantity": 0.75}, {"dimension": "Cloves", "name": "Garlic", "quantity": 4}, {"dimension": "Count", "name": "Scallions", "quantity": 2}, {"dimension": "Count", "name": "Asian Pear", "quantity": 1}, {"dimension": "Pound", "name": "Napa Cabbage", "quantity": 0.5}, {"dimension": "Tablespoons", "name": "Barley Miso Paste", "quantity": 3}, {"dimension": "Tablespoons", "name": "Rice Vinegar", "quantity": 2}, {"dimension": "Tablespoons", "name": "Soy Glaze", "quantity": 2}, {"dimension": "Tablespoon", "name": "Sesame Oil", "quantity": 1}, {"dimension": "Count", "name": " Tablespoon Kimchi Ramen Spice Blend (Gochugaru, Granulated Sugar, Black Sesame Seeds and White Sesame Seeds)", "quantity": 1}], "steps": [{"index": 1, "text": "Heat a large pot of salted water to boiling on high. Once boiling, carefully add the eggs and cook for exactly 7 minutes. Drain and rinse under cold water for 30 seconds to 1 minute to stop the cooking process. When cool enough to handle, carefully peel the cooked eggs and set aside in a warm place. Rinse and wipe out the pot.", "title": "Cook and peel the eggs"}, {"index": 2, "text": "While the eggs cook, wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Cut out and discard the cabbage core; thinly slice the leaves crosswise. Core the pear and cut into matchsticks. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Peel and mince the garlic. In a bowl, combine the miso paste, soy glaze and half the vinegar; whisk to combine.", "title": "Prepare the ingredients"}, {"index": 3, "text": "In a large bowl, combine the cabbage, pear, white bottoms of the scallions, sesame oil, remaining vinegar and (reserving a big pinch) as much of the spice blend as you'd like, depending on how spicy you'd like the dish to be. Drizzle with olive oil and toss to thoroughly combine; season with salt and pepper to taste. Set aside to marinate, stirring occasionally, for at least 10 minutes.", "title": "Make the kimchi"}, {"index": 4, "text": "While the kimchi marinates, in the pot used to cook the eggs, heat 2 teaspoons of olive oil on medium-high until hot. Add the garlic; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until browned and fragrant. Add the miso mixture and 4 cups of water. Bring to a simmer and cook, stirring occasionally, 5 to 7 minutes, or until thoroughly combined and heated through. Add half the kimchi and stir to thoroughly combine. Remove from heat and season with salt and pepper to taste.", "title": "Make the broth"}, {"index": 5, "text": "While the broth simmers, add the noodles to the medium pot of boiling water, gently stirring to separate; cook 2 to 3 minutes, or until tender. Drain thoroughly and divide between 2 bowls. Set aside in a warm place.", "title": "Cook the noodles"}, {"index": 6, "text": "Slice the peeled eggs in half; season with salt and pepper. Divide the broth between the bowls of cooked noodles. Top with the sliced eggs and remaining kimchi. Garnish with the green tops of the scallions and as much of the remaining spice blend as you'd like. Enjoy!", "title": "Plate your dish"}], "metadata": {"subtitle": "with Soft-Boiled Eggs and Asian Pear", "title": "Kimchi and Barley Miso Ramen", "URL": "https://www.blueapron.com/recipes/kimchi-barley-miso-ramen-with-soft-boiled-eggs-asian-pear", "overview": "Miso ramen, with its extra depth of umami flavor, is a much-loved variation on standard ramen. This recipe uses rich, fragrant barley miso (made from fermented soybeans and barley). To put a Korean twist on the Japanese dish, we're making a quick kimchi with napa cabbage and crisp Asian pear. The sweetness of the pear perfectly balances the heat of the gochugaru (Korean chile flakes) in the kimchi's marinade. We're mixing some of the kimchi into the broth and serving the rest on top of each bowl, alongside silky soft-boiled eggs.", "calories": 700, "cookTime": 30, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Rye Bread Boule", "quantity": 1}, {"dimension": "Count", "name": " Ounces Arugula", "quantity": 2}, {"dimension": "Count", "name": " Fennel Bulb", "quantity": 1}, {"dimension": "Count", "name": " Meyer Lemon", "quantity": 1}, {"dimension": "Count", "name": " Pound Heirloom Cauliflower", "quantity": 0.75}, {"dimension": "Count", "name": " Bunch Parsley", "quantity": 1}, {"dimension": "Count", "name": " Ounces Castelvetrano Olives", "quantity": 2}, {"dimension": "Count", "name": " Ounces Piave Cheese", "quantity": 2}, {"dimension": "Count", "name": " Tablespoons Mayonnaise", "quantity": 2}, {"dimension": "Count", "name": " Tablespoon Capers", "quantity": 1}, {"dimension": "Count", "name": "  Sliced Almonds", "quantity": 0.25}], "steps": [{"index": 1, "text": "Preheat the oven to 450 degrees F. Wash and dry the fresh produce. Cut out and discard the cauliflower core; cut the head into bite-sized florets. Medium dice the bread. Roughly chop the capers. Quarter and deseed the lemon. Cut off and discard any fennel stems. Halve the fennel bulb lengthwise; cut out and discard the core, then thinly slice the bulb crosswise. Pick the parsley leaves off the stems; discard the stems. Cut off and discard the rind of the cheese; break the cheese into small pieces. Using the flat side of your knife, smash the olives; remove and discard the pits, then roughly chop the olives.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Place the cauliflower on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast, stirring halfway through, 18 to 20 minutes, or until browned and tender when pierced with a fork. Remove from the oven and transfer to a large bowl.", "title": "Roast the cauliflower"}, {"index": 3, "text": "While the cauliflower roasts, place the bread on a separate sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and toast in the oven 12 to 14 minutes, or until golden brown and crispy on the outside. Remove from the oven.", "title": "Make the croutons"}, {"index": 4, "text": "While the bread toasts, heat a small, dry pan on medium until hot. Add the almonds and toast, stirring occasionally, 2 to 4 minutes, or until lightly browned and fragrant. Transfer to a bowl.", "title": "Toast the almonds"}, {"index": 5, "text": "While the bread continues to toast, in a bowl, combine the mayonnaise, capers and the juice of all 4 lemon wedges; season with salt and pepper to taste.", "title": "Make the dressing"}, {"index": 6, "text": "To the bowl of roasted cauliflower, add the croutons, arugula, fennel, parsley, cheese, olives and toasted almonds; season with salt and pepper. Add enough of the dressing to coat the salad (you may have extra dressing); gently toss to combine and season with salt and pepper to taste. Divide between 2 plates. Enjoy!", "title": "Finish and plate your dish"}], "metadata": {"subtitle": "with Fennel, Piave Cheese and Sliced Almonds", "title": "Roasted Cauliflower Panzanella ", "URL": "https://www.blueapron.com/recipes/winter-panzanella-with-roasted-heirloom-cauliflower-piave-cheese-and-fennel", "overview": "Panzanella is a traditional Tuscan salad popular in the summer. Here, we're adapting the dish to highlight hearty, seasonal vegetables: crisp fennel and heirloom cauliflower, which we're roasting to bring out its mellow sweetness. (Though green cauliflower is pictured, depending on what's fresh near you, yours may be orange or purple.) We're rounding out the salad with oven-toasted croutons, briny olives and Piave cheese - all tossed with a creamy lemon dressing.", "calories": 700, "cookTime": 30, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Pounds Ground Pork", "quantity": 1.125}, {"dimension": "Ounces", "name": "Rigatoni Pasta", "quantity": 10}, {"dimension": "Count", "name": "28-Ounce Can Whole Peeled Tomatoes", "quantity": 1}, {"dimension": "Pound", "name": "Fresh Mozzarella Cheese", "quantity": 0.5}, {"dimension": "Ounces", "name": "Spinach", "quantity": 4}, {"dimension": "Cloves", "name": "Garlic", "quantity": 3}, {"dimension": "Count", "name": "Persian Cucumber", "quantity": 1}, {"dimension": "Count", "name": "Yellow Onion", "quantity": 1}, {"dimension": "Tablespoons", "name": "Red Wine Vinegar", "quantity": 2}, {"dimension": "Tablespoon", "name": "Whole Grain Dijon Mustard", "quantity": 1}, {"dimension": "Tablespoon", "name": "Rigatoni Spice Blend (Whole Fennel Seeds, Ground Fennel, Ground Coriander, Italian Seasoning and Garlic Powder)", "quantity": 1}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Heat a large pot of salted water to boiling on high. Once boiling, add the pasta. Cook 9 to 11 minutes, or until al dente (still slightly firm to the bite). Drain thoroughly and rinse under cold water to stop the cooking process. Rinse and dry the pot.", "title": "Cook the pasta"}, {"index": 2, "text": "While the pasta cooks, wash and dry the fresh produce. Peel and thinly slice the garlic. Peel, halve and thinly slice the onion.  Tear the mozzarella cheese into bite-sized pieces. Thinly slice the cucumber into rounds. Place the tomatoes in a bowl; gently break apart with your hands.", "title": "Prepare the ingredients"}, {"index": 3, "text": "In the pot used to cook the pasta, heat 1 tablespoon of olive oil on medium-high until hot. Add the garlic and onion; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened and fragrant. Add the ground pork and spice blend; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 2 to 3 minutes, or until the pork is lightly browned and cooked through. Carefully drain off and discard any drippings from the pot.", "title": "Start the sauce"}, {"index": 4, "text": "Add the tomatoes to the pot; cook, stirring occasionally, 6 to 8 minutes, or until thoroughly combined and slightly reduced in volume. Remove from heat and season with salt and pepper to taste.", "title": "Finish the sauce"}, {"index": 5, "text": "Add the cooked pasta to the pot of finished sauce; stir to thoroughly combine and season with salt and pepper to taste. Transfer to a baking dish. Evenly top with the cheese; season with salt and pepper. Bake 12 to 14 minutes, or until slightly crispy on top and the cheese has melted. Remove from the oven and let stand for 2 minutes before serving.", "title": "Assemble and bake the pasta"}, {"index": 6, "text": "While the pasta bakes, in a small bowl, combine the vinegar and mustard; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. Just before serving, in a large bowl, combine the spinach, cucumber and enough of the vinaigrette to coat the salad (you may have extra vinaigrette). Toss to mix and season with salt and pepper to taste. Transfer to a serving dish. Serve with the baked pasta. Enjoy!", "title": "Make the salad and serve your dish"}], "metadata": {"subtitle": "with Fresh Mozzarella and Spinach Salad", "title": "Spiced Pork and Baked Rigatoni Pasta", "URL": "https://www.blueapron.com/recipes/spiced-pork-baked-rigatoni-pasta-with-fresh-mozzarella-spinach-salad", "overview": "In this recipe, we're making a rich and hearty meat sauce with ground pork, hand-crushed tomatoes and classic Italian spices. (Be gentle when you crush the tomatoes! Their juices may spray.) We're mixing our sauce with chewy rigatoni pasta, topping it with silky mozzarella cheese and baking it all in the oven until the top crisps up and the flavors meld to perfection. A simple spinach and cucumber salad on the side brings color and balance to this robust meal.", "calories": 700, "cookTime": 45, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Pork Roast", "quantity": 1}, {"dimension": "Count", "name": " Sandwich Rolls", "quantity": 2}, {"dimension": "Count", "name": " Slices Swiss Cheese", "quantity": 4}, {"dimension": "Cloves", "name": "Garlic", "quantity": 2}, {"dimension": "Count", "name": " Lime", "quantity": 1}, {"dimension": "Count", "name": "Persian Cucumber", "quantity": 1}, {"dimension": "Count", "name": "Black Plantain", "quantity": 1}, {"dimension": "Count", "name": " Bunch Lacinato Kale", "quantity": 0.5}, {"dimension": "Tablespoons", "name": "Whole Grain Dijon Mustard", "quantity": 2}, {"dimension": "Tablespoons", "name": "Apple Cider Vinegar", "quantity": 2}, {"dimension": "Count", "name": " Tablespoon Sugar", "quantity": 1}], "steps": [{"index": 1, "text": "Preheat the oven to 450 degrees F. Pat the pork dry with paper towels; season with salt and pepper on all sides. In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned pork; cook, turning occasionally, 5 to 7 minutes, or until browned on all sides. Transfer to a foil-lined sheet pan; roast 18 to 20 minutes, or until cooked through. (An instant-read thermometer should register 145 degrees F.) Transfer to a cutting board; let rest for at least 5 minutes. Rinse and wipe out the pan.", "title": "Sear and roast the pork"}, {"index": 2, "text": "While the pork sears, wash and dry the fresh produce. Thinly slice the cucumber into rounds; place in a heatproof bowl. Peel the garlic. Using the flat side of your knife, smash 1 garlic clove once to flatten it. Mince the remaining garlic clove; using the flat side of your knife, smash until it resembles a paste (or use a zester). Peel the plantain; slice into 3 degrees 4-inch-thick rounds. Halve the rolls. Quarter the lime. Remove and discard the kale stems; roughly chop the leaves.", "title": "Prepare the ingredients"}, {"index": 3, "text": "While the pork roasts, add the smashed garlic clove to the bowl of cucumber. In the pan used to sear the pork, combine the sugar, vinegar, a big pinch of salt and 1 degrees 2 cup of water; heat to boiling on high. Once boiling, remove from heat and carefully pour over the cucumber-garlic mixture. Set aside to pickle, stirring occasionally, for at least 5 minutes. Rinse and wipe out the pan.", "title": "Make the pickles"}, {"index": 4, "text": "While the pork continues to roast, in the same pan, heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a plantain slice sizzles immediately when added to the pan, add the plantain; cook 3 to 4 minutes per side, or until browned. Transfer to a paper towel-lined plate; immediately season with salt. Carefully discard the oil and wipe out the pan.", "title": "Cook the plantain"}, {"index": 5, "text": "Find the lines of muscle (or grain) of the rested pork; thinly slice against the grain. Place the rolls on a work surface; spread a layer of the mustard onto each half. Divide the sliced pork, cheese and pickles (discarding the garlic and draining before adding) between the roll bottoms; top with the roll tops. In the pan used to cook the plantains, heat 2 teaspoons of olive oil on medium until hot. Add the sandwiches; place a heavy pot on top. Cook, occasionally pressing down on the pot, 2 to 4 minutes per side, or until the rolls are crispy and the cheese has melted. Transfer to a cutting board.", "title": "Assemble and toast the sandwiches"}, {"index": 6, "text": "While the sandwiches toast, in a bowl, combine the garlic paste and the juice of all 4 lime wedges; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. Just before serving, in a medium bowl, combine the kale, cooked plantain and enough of the dressing to coat the salad (you may have extra dressing). Toss to combine; season with salt and pepper to taste. Cut the toasted sandwiches in half; divide between 2 plates. Serve with the salad on the side. Enjoy!", "title": "Make the salad and plate your dish"}], "metadata": {"subtitle": "with Sweet Plantain and Kale Salad", "title": "Cuban Sandwiches", "URL": "https://www.blueapron.com/recipes/cuban-sandwiches-with-sweet-plantain-kale-salad", "overview": "Tonight's dinner is the irresistible, time-honored Cuban sandwich - with its origins on the island as early as the 1860s. We're filling soft rolls with slices of tender, twice-cooked pork and melty Swiss cheese, along with crunchy homemade pickles. Then we're pan-toasting the sandwiches, flattening them with a heavy pot to create that famous crust. To finish, we're serving a salad of kale and fried sweet plantain, brightened up with a garlic-lime dressing. (Any black or brown on your plantain's peel indicates that it's ripe enough for this preparation.)", "calories": 700, "cookTime": 45, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Boneless, Skinless Chicken Breasts", "quantity": 4}, {"dimension": "Count", "name": " Farm Eggs", "quantity": 2}, {"dimension": "Cup", "name": "Panko Breadcrumbs", "quantity": 1}, {"dimension": "es", "name": "Radish", "quantity": 3}, {"dimension": "Ounces", "name": "Arugula", "quantity": 2}, {"dimension": "Count", "name": " Pound Yukon Gold Potatoes", "quantity": 1}, {"dimension": "Count", "name": "Lemon", "quantity": 1}, {"dimension": "Tablespoons", "name": "Whole Grain Dijon Mustard", "quantity": 2}, {"dimension": "Tablespoon", "name": "Apple Cider Vinegar", "quantity": 1}, {"dimension": "Cup", "name": "All-Purpose Flour", "quantity": 0.25}, {"dimension": "Cup", "name": "Sour Cream", "quantity": 0.25}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Wash and dry the fresh produce. Medium dice the potatoes. Crack the eggs into a medium bowl; beat until smooth. Cut off and discard the ends of the radishes; very thinly slice the radishes into rounds. Quarter and deseed the lemon.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Place the potatoes on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast 18 to 20 minutes, or until tender when pierced with a fork. Remove from the oven.", "title": "Roast the potatoes"}, {"index": 3, "text": "While the potatoes roast, place the flour and breadcrumbs in 2 separate medium bowls; season each with salt and pepper. Pat the chicken dry with paper towels; season with salt and pepper on both sides. Working 1 piece at a time, thoroughly coat both sides of the seasoned chicken in the flour (tapping off any excess), then in the eggs (letting the excess drip off), then in the breadcrumbs (pressing to adhere).", "title": "Bread the chicken"}, {"index": 4, "text": "While the potatoes continue to roast, in a large pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a few breadcrumbs sizzle immediately when added to the pan, add the breaded chicken. Cook 4 to 6 minutes per side, or until golden brown and cooked through. Transfer to a paper towel-lined plate; immediately season with salt and pepper.", "title": "Cook the chicken"}, {"index": 5, "text": "While the chicken cooks, in a small bowl, combine the vinegar, mustard and sour cream; season with salt and pepper to taste. Slowly whisk in 1 tablespoon of olive oil until well combined.", "title": "Make the dressing"}, {"index": 6, "text": "Just before serving, in a large bowl, combine the roasted potatoes, arugula and radishes; season with salt and pepper. Add enough of the dressing to coat the salad (you will have extra dressing). Toss to mix; season with salt and pepper to taste. Divide the salad and cooked chicken between 4 plates. Garnish with the lemon wedges. Serve with the remaining dressing on the side, if you'd like. Enjoy!", "title": "Make the salad and plate your dish"}], "metadata": {"subtitle": "with Arugula, Potato and Radish Salad", "title": "Chicken Milanese", "URL": "https://www.blueapron.com/recipes/chicken-milanese-with-arugula-potato-radish-salad", "overview": "Chicken milanese (or milanesa) is a fried, breaded cutlet with roots in Italian cuisine. But it's especially popular in Latin America, where it can be found paired with any number of local and seasonal sides. (19th Century Italian immigrants likely shared the dish with the communities they joined.) In our version, we're breading chicken with flour, egg and breadcrumbs, then pan-frying it to a gorgeous golden brown. On the side, we're serving a warm salad of peppery arugula, roasted potatoes, radishes and a sour cream dressing, for the perfect piquant counterpoint.", "calories": 580, "cookTime": 30, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Farm Eggs", "quantity": 4}, {"dimension": "Count", "name": "Small Baguettes", "quantity": 2}, {"dimension": "Ounces", "name": "Fontina Cheese", "quantity": 4}, {"dimension": "Cloves", "name": "Garlic", "quantity": 4}, {"dimension": "Pound", "name": "Multicolored Fingerling Potatoes", "quantity": 1}, {"dimension": "Pound", "name": "Brussels Sprouts", "quantity": 0.5}, {"dimension": "Count", "name": "Red Onion", "quantity": 1}, {"dimension": "Bunch", "name": "Parsley", "quantity": 1}, {"dimension": "Tablespoons", "name": "Butter", "quantity": 4}, {"dimension": "Tablespoons", "name": "Grated Parmesan Cheese", "quantity": 2}], "steps": [{"index": 1, "text": "Preheat the oven to 450 degrees F. Wash and dry the fresh produce. Thinly slice the potatoes into rounds. Keeping the bottom intact, slice each baguette into 1-inch-thick pieces. Peel and mince the garlic. Peel the onion and cut into large wedges; separate the layers. Cut off and discard the ends of the Brussels sprouts; halve lengthwise, then thinly slice crosswise. Remove and discard the Fontina cheese rind; small dice. Pick the parsley off the stems; discard the stems.", "title": "Prepare the ingredients "}, {"index": 2, "text": "In a large pan (nonstick and oven-safe, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the potatoes and season with salt and pepper. Cook, stirring occasionally, 10 to 12 minutes, or until browned and tender.", "title": "Start the vegetables "}, {"index": 3, "text": "While the potatoes cook, cut a piece of aluminum foil twice the length of a sheet pan. Line a sheet pan with the foil, allowing the extra foil to hang off one of the edges. Place the baguettes on the foil-lined sheet pan. In a small pot, combine the butter and half the garlic; season with salt and pepper. Cook on medium, swirling occasionally, 2 to 3 minutes, or until well combined and the butter has melted. Evenly spoon the garlic butter and Parmesan cheese into the slices in the baguettes. Fold the extra foil back over the baguettes, then tightly roll the edges of the foil together to seal.", "title": "Prepare the garlic bread "}, {"index": 4, "text": "Add the onion to the pan of potatoes; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened. Add the Brussels sprouts and remaining garlic; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until softened and fragrant. Remove from heat. (If your pan isn't oven-safe, transfer the finished vegetables to a baking dish.)", "title": "Finish the vegetables  "}, {"index": 5, "text": "Using a spoon, create 4 wells in the center of the finished vegetables. Crack an egg into each well; season with salt and pepper. Top with the Fontina cheese. Bake 6 to 8 minutes, or until the egg whites are set and the yolks are cooked to your desired degree of doneness. Remove from the oven. While the eggs bake, toast the garlic bread in the oven 7 to 9 minutes, or until the Parmesan cheese has melted and the baguettes are crispy. Remove from the oven.", "title": "Bake the eggs and toast the garlic bread "}, {"index": 6, "text": "Garnish the baked eggs and vegetables with the parsley. Serve with the toasted garlic bread on the side. Enjoy!", "title": "Serve your dish  "}], "metadata": {"subtitle": "with Brussels Sprouts and Fingerling Potatoes ", "title": "Baked Eggs and Cheesy Garlic Bread", "URL": "https://www.blueapron.com/recipes/baked-eggs-cheesy-garlic-bread-with-brussels-sprouts-fingerling-potatoes", "overview": "Chefs, tonight we're serving up an all-time family favorite: breakfast for dinner! We're baking up a skillet of crispy, colorful fingerling potatoes, thinly sliced Brussels sprouts, onion and eggs, all topped with melty Fontina cheese. On the side, we're making delicious, oven-toasted garlic bread. We're melting butter with garlic, spooning it into sliced baguettes with grated Parmesan cheese, then toasting them in foil. Garnished with parsley, this is a hearty, gourmet take on classic comfort food.", "calories": 615, "cookTime": 35, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Skin-On Salmon Fillets", "quantity": 4}, {"dimension": "Pound", "name": "Fresh Udon Noodles", "quantity": 1}, {"dimension": "Ounces", "name": "Cremini Mushrooms", "quantity": 6}, {"dimension": "Bunch", "name": "Kale", "quantity": 1}, {"dimension": "Tablespoons", "name": "White Miso Paste", "quantity": 3}, {"dimension": "Tablespoons", "name": "Maple Syrup", "quantity": 2}, {"dimension": "Tablespoons", "name": "Rice Vinegar", "quantity": 2}, {"dimension": "Teaspoons", "name": "White Sesame Seeds", "quantity": 2}, {"dimension": "Count", "name": "1-Inch Piece Ginger", "quantity": 1}, {"dimension": "Tablespoon", "name": "Sesame Oil", "quantity": 1}, {"dimension": "Cup", "name": "Ponzu Sauce", "quantity": 0.25}], "steps": [{"index": 1, "text": "Wash and dry the fresh produce. Remove and discard the kale stems; roughly chop the leaves. Thinly slice the mushrooms. Peel and mince the ginger. To make the glaze, in a bowl, combine the maple syrup, miso paste, half the vinegar and 1 degrees 4 cup of water; whisk until smooth.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Heat a large, dry pan (nonstick, if you have one) on medium-high until hot. Add the kale and 1 degrees 2 cup of water; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until the kale has wilted and the water has cooked off. Transfer to a bowl and set aside in a warm place. Wipe out the pan.", "title": "Cook the kale"}, {"index": 3, "text": "In the pan used to cook the kale, heat 2 teaspoons of olive oil on medium-high until hot. Add the mushrooms. Cook, stirring occasionally, 4 to 6 minutes, or until lightly browned. Add the ginger and sesame oil; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant.", "title": "Cook the mushrooms"}, {"index": 4, "text": "To the pan of mushrooms, add the noodles (carefully separating with your hands before adding), cooked kale, ponzu sauce, remaining vinegar and 2 tablespoons of water; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until well combined. Remove from heat and divide between 4 dishes; set aside in a warm place. Rinse and dry the pan.", "title": "Add the kale and noodles"}, {"index": 5, "text": "Pat the salmon fillets dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the vegetables and noodles, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned fillets, skinless sides down. Cook 2 to 4 minutes on the first side, or until lightly browned. Flip the fillets and add the glaze. Cook, occasionally spooning the glaze over the fillets, 2 to 4 minutes, or until the liquid has reduced in volume by about half and the fillets are cooked to your desired degree of doneness.", "title": "Cook and glaze the salmon"}, {"index": 6, "text": "Top the dishes of cooked vegetables and noodles with the glazed salmon fillets. Garnish with the sesame seeds. Enjoy!", "title": "Serve your dish"}], "metadata": {"subtitle": "with Fresh Udon Noodles and Cremini Mushrooms", "title": "Miso and Maple-Glazed Salmon", "URL": "https://www.blueapron.com/recipes/miso-maple-glazed-salmon-with-fresh-udon-noodles-cremini-mushrooms", "overview": "In this recipe, we're preparing an elegant glaze for our hearty salmon fillets with white miso paste, maple syrup and a touch of rice vinegar. This delicious balance of sweet and savory perfectly complements fresh udon noodles, kale and cremini mushrooms tossed in a light, citrusy ponzu sauce. Garnished with a sprinkling of crunchy white sesame seeds, it makes for a sophisticated, Japanese-inspired dinner.", "calories": 665, "cookTime": 30, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Skin-On Salmon Fillets", "quantity": 2}, {"dimension": "Pound", "name": "Purple Potatoes", "quantity": 0.75}, {"dimension": "Ounces", "name": "Spinach", "quantity": 2}, {"dimension": "Count", "name": "Red Onion", "quantity": 1}, {"dimension": "Tablespoons", "name": "Walnuts", "quantity": 2}, {"dimension": "Count", "name": "Shallot", "quantity": 1}, {"dimension": "Tablespoon", "name": "Capers", "quantity": 1}, {"dimension": "Count", "name": " Tablespoon Red Wine Vinegar", "quantity": 1}, {"dimension": "Cup", "name": "Grated Parmesan Cheese", "quantity": 0.3333333333333333}], "steps": [{"index": 1, "text": "Wash and dry the fresh produce. Large dice the potatoes. Finely chop the walnuts. Peel the onion and cut into large wedges; separate the layers. Roughly chop the capers. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a medium bowl with the vinegar.", "title": "Prepare the ingredients "}, {"index": 2, "text": "In a medium pan (nonstick, if you have one), heat 1 teaspoon of olive oil on medium-high until hot. Add the spinach; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until wilted. Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the cooked spinach to release as much liquid as possible; discard the liquid. Transfer the drained spinach to a cutting board. Wipe out the pan.", "title": "Cook and drain the spinach "}, {"index": 3, "text": "In the pan used to cook the spinach, heat 2 teaspoons of olive oil on medium-high until hot. Add the potatoes; season with salt and pepper. Cook, stirring occasionally, 8 to 10 minutes, or until lightly browned. Add the onion; season with salt and pepper. Cook, stirring occasionally, 6 to 8 minutes, or until the potatoes and onion have softened. Divide between 2 plates and set aside in a warm place. Wipe out the pan.", "title": "Make the hash "}, {"index": 4, "text": "While the hash cooks, finely chop the drained spinach and transfer to the bowl with the shallot-vinegar mixture. Stir in the walnuts, capers and cheese; season with salt and pepper. Slowly stir in enough olive oil to create a rough paste; season with salt and pepper to taste.", "title": "Make the pesto "}, {"index": 5, "text": "Pat the salmon fillets dry with paper towels; season with salt and pepper on both sides. In the pan used to make the hash, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned fillets, skinless sides down, and cook 2 to 3 minutes per side, or until browned and cooked to your desired degree of doneness. Remove from heat.", "title": "Cook the salmon "}, {"index": 6, "text": "Divide the cooked salmon fillets between the plates of hash. Garnish with the pesto. Enjoy!", "title": "Plate your dish "}], "metadata": {"subtitle": "with Purple Potato and Red Onion Hash", "title": "Seared Salmon and Spinach-Walnut Pesto", "URL": "https://www.blueapron.com/recipes/seared-salmon-spinach-walnut-pesto-with-purple-potato-red-onion-hash", "overview": "Mild, buttery salmon and delicately earthy spinach make for a beautiful and simple pairing. Here, we're exploring a unique take on the duo by serving our salmon fillets with a spinach-walnut pesto. Made with sharp Parmesan, briny capers and olive oil, the sauce adds exciting depth of flavor to this classic dish. We're serving it all over a hash of red onion and purple potatoes - a gorgeous and particularly tasty variety.", "calories": 700, "cookTime": 35, "servings": 2}}
{"ingredients": [{"dimension": "Ounces", "name": "Gnocchi", "quantity": 10}, {"dimension": "Count", "name": " Pound Brussels Sprouts", "quantity": 0.5}, {"dimension": "Count", "name": " Clove Garlic", "quantity": 1}, {"dimension": "Count", "name": " Meyer Lemon", "quantity": 1}, {"dimension": "Count", "name": "Red Onion", "quantity": 1}, {"dimension": "Bunch", "name": "Thyme", "quantity": 1}, {"dimension": "Tablespoons", "name": "Butter", "quantity": 3}, {"dimension": "Count", "name": "  Grated Parmesan Cheese", "quantity": 0.3333333333333333}], "steps": [{"index": 1, "text": "Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and mince the garlic. Peel, halve and thinly slice the onion. Cut off and discard the stem ends of the Brussels sprouts. Pick off and reserve the Brussels sprout leaves until you reach the lighter cores; discard the cores. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Pick the thyme leaves off the stems; discard the stems and roughly chop the leaves.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Add the gnocchi to the pot of boiling water and cook 2 to 3 minutes, or until the gnocchi float to the top of the pot. Reserving 1 degrees 2 cup of the gnocchi cooking water, drain thoroughly.", "title": "Cook the gnocchi"}, {"index": 3, "text": "In a large pan, heat the butter on medium-high until melted. Add the cooked gnocchi and cook, stirring and swirling the pan occasionally, 5 to 7 minutes, or until the gnocchi are lightly browned and the butter is deep golden brown and fragrant.", "title": "Brown the gnocchi and butter"}, {"index": 4, "text": "Add the garlic and onion to the pan of gnocchi and butter; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened.", "title": "Add the aromatics"}, {"index": 5, "text": "Add the Brussels sprouts, thyme, lemon zest, the juice of 2 lemon wedges and half the reserved gnocchi cooking water to the pan of gnocchi, butter and aromatics. Cook, stirring constantly, 1 to 2 minutes, or until thoroughly combined. (If the sauce seems dry, gradually add the remaining gnocchi cooking water to achieve your desired consistency.) Remove from heat and season with salt and pepper to taste.", "title": "Finish the gnocchi"}, {"index": 6, "text": "Divide the finished gnocchi between 2 dishes. Garnish with the cheese. Serve with the remaining lemon wedges on the side, if you'd like. Enjoy!", "title": "Plate your dish"}], "metadata": {"subtitle": "with Meyer Lemon and Brussels Sprouts", "title": "Crispy Brown Butter Gnocchi", "URL": "https://www.blueapron.com/recipes/crispy-brown-butter-gnocchi-with-meyer-lemon-brussels-sprouts", "overview": "This classic Italian meal gets its spectacular flavor from a few simple techniques and late-winter ingredients. We're crisping up hearty, potato-based gnocchi in a pan of browned butter (or butter heated past its melting point, for deliciously nutty taste). Then we're adding bright, tangy Meyer lemon to cut the richness of the browned butter sauce. With earthy Brussels sprout leaves and woodsy thyme, this dish is as comforting as it is gourmet.", "calories": 515, "cookTime": 25, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Ounces Ground Pork", "quantity": 10}, {"dimension": "Count", "name": " Slice Bacon", "quantity": 1}, {"dimension": "Count", "name": " Pound Fresh Ramen Noodles", "quantity": 0.75}, {"dimension": "Count", "name": " Ounce Pea Tips", "quantity": 1}, {"dimension": "Count", "name": " Bunch Garlic Chives", "quantity": 1}, {"dimension": "Count", "name": " Tablespoons Pork Demi-Glace", "quantity": 2}, {"dimension": "Count", "name": " Tablespoons Soy Sauce", "quantity": 2}, {"dimension": "Tablespoons", "name": "Mirin", "quantity": 2}, {"dimension": "Count", "name": " Head Garlic", "quantity": 1}, {"dimension": "Count", "name": " 1-Inch Piece Ginger", "quantity": 1}, {"dimension": "Teaspoon", "name": "Pork Mazemen Spice Blend (Black Sesame Seeds, White Sesame Seeds, Kibbled Nori and Smoked Paprika)", "quantity": 0.5}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Cut off and discard the top of the garlic head to expose the cloves, keeping the rest of the head as intact as possible. Place on a piece of aluminum foil; drizzle with olive oil and season with salt and pepper. Tightly wrap the seasoned garlic head in the foil. Place on a sheet pan and roast 28 to 30 minutes, or until the cloves are browned and very tender. Remove from the oven and carefully unwrap; set aside to cool slightly.", "title": "Roast the garlic"}, {"index": 2, "text": "While the garlic roasts, wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and mince the ginger. Thinly slice the garlic chives. Roughly chop any large pea tips. Small dice the bacon.", "title": "Prepare the ingredients"}, {"index": 3, "text": "While the garlic continues to roast, in a large pot, heat 1 teaspoon of olive oil on medium until hot. Add the bacon and cook, stirring occasionally, 3 to 4 minutes, or until browned and crispy.", "title": "Cook the bacon"}, {"index": 4, "text": "Add the ginger and all but a big pinch of the garlic chives to the pot of bacon; cook, stirring frequently, 2 to 3 minutes, or until softened and fragrant. Add the ground pork; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 4 to 5 minutes, or until lightly browned and cooked through; season with salt and pepper. Turn off the heat.", "title": "Add the aromatics and ground pork"}, {"index": 5, "text": "When cool enough to handle, using your hands, gently squeeze the individual cloves out of the roasted garlic head; discard the skins. To the pot of bacon, aromatics and ground pork, add the roasted garlic cloves, soy sauce, mirin, demi-glace and 1 cup of water; stir to thoroughly combine. Heat to boiling on high. Once boiling, reduce the heat to medium and simmer, stirring occasionally, 2 to 3 minutes, or until the liquid is slightly reduced in volume.", "title": "Make the sauce"}, {"index": 6, "text": "While the sauce simmers, add the noodles to the medium pot of boiling water, gently stirring to separate; cook 2 to 3 minutes, or until tender. Drain thoroughly and transfer to the pot of sauce; cook, stirring constantly, 1 to 2 minutes, or until the noodles are thoroughly coated. Turn off the heat. Stir in the pea tips; season with salt and pepper to taste. Divide 2 degrees 3 of the finished mazemen between 2 bowls (you will have extra). Garnish with the remaining garlic chives and as much of the spice blend as you'd like. Enjoy!", "title": "Finish the mazemen and plate your dish"}], "metadata": {"subtitle": "with Roasted Garlic and Pea Tips", "title": "Triple Pork Mazemen", "URL": "https://www.blueapron.com/recipes/triple-pork-ramen-with-roasted-garlic-pea-tips", "overview": "The endless popularity of ramen has resulted in many variations on the Japanese dish - like mazemen, or brothless ramen. We're infusing our mazemen with the boldness of whole roasted garlic, which turns mellow and sweet in the oven. With hearty pea tips (the leaves of the pea plant) and three delicious forms of pork, our mazemen offers a uniquely satisfying take on the classic. And best of all, we're sending you enough for leftovers!", "calories": 560, "cookTime": 40, "servings": 3}}
{"ingredients": [{"dimension": "Count", "name": " Pound Chicken Tenders", "quantity": 0.75}, {"dimension": "Cup", "name": "Jasmine Rice", "quantity": 0.75}, {"dimension": "Ounces", "name": "Baby Bok Choy", "quantity": 6}, {"dimension": "Cloves", "name": "Garlic", "quantity": 4}, {"dimension": "Count", "name": "Scallions", "quantity": 2}, {"dimension": "Count", "name": "Yellow Onion", "quantity": 1}, {"dimension": "Count", "name": "Fresh Bay Leaves", "quantity": 2}, {"dimension": "Tablespoons", "name": "Soy Sauce", "quantity": 2}, {"dimension": "Count", "name": "1-Inch Piece Ginger", "quantity": 1}, {"dimension": "Cup", "name": "Rice Vinegar", "quantity": 0.25}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Wash and dry the fresh produce. Cut off and discard the root end of the bok choy; separate the leaves. Peel and mince the garlic and ginger. Peel, halve and thinly slice the onion. Cut off and discard the root ends of the scallions; thinly slice the white bottoms and cut the green tops into 1 degrees 2-inch pieces, keeping them separate. Pat the chicken dry with paper towels; chop into bite-sized pieces.", "title": "Prepare the ingredients"}, {"index": 2, "text": "In a small pot, combine the rice, a big pinch of salt and 11 degrees 2 cups of water; heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork.", "title": "Cook the rice"}, {"index": 3, "text": "While the rice cooks, place the bok choy and half the garlic on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange the seasoned bok choy in a single, even layer and roast 8 to 10 minutes, or until the leaves are lightly browned and the stems are tender when pierced with a fork. Remove from the oven and set aside in a warm place.", "title": "Roast the bok choy"}, {"index": 4, "text": "While the bok choy roasts, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the chopped chicken, ginger, onion, bay leaves, white bottoms of the scallions and remaining garlic; season with salt and pepper. Cook, stirring occasionally, 5 to 7 minutes, or until the chicken is lightly browned and the aromatics have softened.", "title": "Start the chicken and aromatics"}, {"index": 5, "text": "Add the soy sauce and vinegar to the pan of chicken and aromatics; simmer, stirring occasionally, 2 to 4 minutes, or until the chicken is cooked through and the liquid has reduced in volume by about half. Turn off the heat and season with salt and pepper to taste. Carefully remove and discard the bay leaves.", "title": "Finish the chicken and aromatics"}, {"index": 6, "text": "Divide the cooked rice, roasted bok choy and finished chicken and aromatics between 2 plates. Garnish with the green tops of the scallions. Enjoy!", "title": "Plate your dish"}], "metadata": {"subtitle": "with Roasted Bok Choy and Jasmine Rice", "title": "Adobo-Style Chicken", "URL": "https://www.blueapron.com/recipes/adobo-style-chicken-with-roasted-bok-choy-jasmine-rice", "overview": "Adobo is a cornerstone of Filipino cuisine, enjoyed (and prepared a little differently) across the archipelago. The word describes a dish made with soy sauce, vinegar, garlic and bay leaves - simple ingredients that come together in a distinctive flavor profile. We're serving our savory, tangy adobo-style chicken with tender baby bok choy and jasmine rice. Just remember to discard the bay leaves at the end - . Simmering them in the sauce is enough to infuse the dish with their aromatic notes.", "calories": 635, "cookTime": 25, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Farm Eggs", "quantity": 2}, {"dimension": "Cup", "name": "Fregola Sarda Pasta", "quantity": 0.5}, {"dimension": "Count", "name": " Pound Broccoli", "quantity": 1}, {"dimension": "Count", "name": " Clove Garlic", "quantity": 1}, {"dimension": "Count", "name": " Lemon", "quantity": 1}, {"dimension": "Count", "name": "Red Onion", "quantity": 1}, {"dimension": "Bunch", "name": "Mint", "quantity": 1}, {"dimension": "Count", "name": " Ounces Pecorino Cheese", "quantity": 2}, {"dimension": "Tablespoons", "name": "Tahini", "quantity": 2}, {"dimension": "Count", "name": " Teaspoons Za'atar", "quantity": 2}, {"dimension": "Cup", "name": "Sliced Almonds", "quantity": 0.25}], "steps": [{"index": 1, "text": "Heat a large pot of salted water to boiling on high. Once boiling, add the pasta and cook 14 to 17 minutes, or until tender. Drain thoroughly and return to the pot. Off the heat, stir in a drizzle of olive oil and season with salt and pepper to taste.", "title": "Cook the fregola sarda"}, {"index": 2, "text": "While the pasta cooks, preheat the oven to 450 degrees F. Wash and dry the fresh produce. Heat a small pot of salted water to boiling on high. Cut the broccoli into bite-sized florets. Peel, halve and thinly slice the onion. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Quarter and deseed the lemon. Using a paring knife or fork, break the cheese into small pieces. Pick the mint leaves off the stems; discard the stems.", "title": "Prepare the ingredients"}, {"index": 3, "text": "While the pasta continues to cook, place the broccoli and onion on a sheet pan. Drizzle with olive oil and season with salt, pepper and the za'atar; toss to thoroughly coat. Arrange in a single, even layer and roast 20 to 22 minutes, or until browned and tender when pierced with a fork. Remove from the oven.", "title": "Roast the broccoli and onion"}, {"index": 4, "text": "While the broccoli and onion roast, in a bowl, combine the garlic paste, tahini, the juice of 2 lemon wedges and 2 tablespoons of water; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined.", "title": "Make the dressing"}, {"index": 5, "text": "While the broccoli and onion continue to roast, add the eggs to the small pot of boiling water and cook for exactly 9 minutes. Drain and rinse under cold water for 30 seconds to 1 minute to stop the cooking process. When cool enough to handle, carefully peel the cooked eggs; transfer to a cutting board and thinly slice into rounds.", "title": "Cook and peel the eggs"}, {"index": 6, "text": "To the pot of cooked pasta, add the roasted broccoli and onion, almonds, cheese, dressing and the juice of the remaining lemon wedges. Stir to thoroughly combine and season with salt and pepper to taste. Divide the finished salad between 2 dishes. Top with the sliced eggs; season the eggs with salt and pepper. Garnish with the mint. Enjoy!", "title": "Finish and plate your dish"}], "metadata": {"subtitle": "with Hard-Boiled Eggs and Tahini Dressing", "title": "Roasted Broccoli and Fregola Sarda Salad", "URL": "https://www.blueapron.com/recipes/roasted-broccoli-fregola-sarda-salad-with-pecorino-cheese-tahini-dressing", "overview": "In this Middle Eastern-inspired recipe, we're putting an exciting, gourmet spin on warm pasta salad. Our pasta of choice is fregola sarda (a round, toasted variety from Sardinia). We're tossing it with sliced almonds, crumbled pecorino cheese and za'atar-spiced broccoli, roasted for a satisfyingly crispy bite. But what really brings these elements together is the dressing. Tahini, a paste made from sesame seeds, completes the dish with its creamy texture and irresistibly nutty flavor.", "calories": 600, "cookTime": 40, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " 14-Ounce Package Extra Firm Tofu", "quantity": 1}, {"dimension": "s", "name": "Black Plantain", "quantity": 2}, {"dimension": "Cloves", "name": "Garlic", "quantity": 2}, {"dimension": "Count", "name": " Bunch Collard Greens", "quantity": 1}, {"dimension": "Count", "name": " Lime", "quantity": 1}, {"dimension": "Count", "name": " Red Onion", "quantity": 1}, {"dimension": "Bunch", "name": "Cilantro", "quantity": 1}, {"dimension": "Count", "name": "1-Inch Piece Ginger", "quantity": 1}, {"dimension": "Count", "name": "  Coconut Milk Powder", "quantity": 0.25}, {"dimension": "Count", "name": " Tablespoon Jerk Tofu Spice Blend (Ground Cinnamon, Ground Cardamom, Dried Oregano, Smoked Paprika, Ground Ginger, Dried Lemon Peel, Light Brown Sugar and Ground Cayenne Pepper)", "quantity": 1}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Drain the tofu and thoroughly pat dry with paper towels; slice into six 1 degrees 2-inch-thick planks. Peel the plantains; slice into 1 degrees 2-inch-thick rounds. Using a peeler, remove the rind of the lime, avoiding the pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter the lime. Peel, halve and thinly slice the onion. Peel and mince the garlic and ginger. Remove and discard the collard green stems; roughly chop. Pick the cilantro leaves off the stems; discard the stems. In a bowl, whisk together the coconut milk powder and 1 degrees 4 cup of water.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Place the tofu on a sheet pan. Drizzle with olive oil and season with salt and pepper; turn to coat. Thoroughly coat both sides of the seasoned tofu with as much of the spice blend as you'd like, depending on how spicy you'd like the dish to be. Bake, flipping halfway through, 24 to 26 minutes, or until browned and crispy on both sides. Remove from the oven.", "title": "Bake the tofu"}, {"index": 3, "text": "While the tofu bakes, add the plantains to the pot of boiling water and cook 9 to 11 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot. Off the heat, using a fork, smash the cooked plantains to your desired consistency. Add the lime zest, coconut milk powder mixture and the juice of 2 lime wedges. Stir until thoroughly combined; season with salt and pepper to taste. Set aside in a warm place.", "title": "Cook and smash the plantains"}, {"index": 4, "text": "While the plantains cook, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the onion, garlic and ginger; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened and fragrant.", "title": "Cook the aromatics"}, {"index": 5, "text": "Add the collard greens and 3 degrees 4 cup of water to the pan of aromatics; season with salt and pepper. Reduce the heat to medium and cook, stirring occasionally, 12 to 14 minutes, or until the collard greens have wilted and the water has cooked off. Remove from heat and season with salt and pepper to taste.", "title": "Add the collard greens"}, {"index": 6, "text": "Divide the smashed plantains and cooked collard greens between 2 plates. Top with the baked tofu. Garnish with the cilantro and remaining lime wedges. Enjoy!", "title": "Plate your dish"}], "metadata": {"subtitle": "with Garlic-Ginger Collard Greens", "title": "Baked Jerk Tofu and Smashed Plantains", "URL": "https://www.blueapron.com/recipes/baked-jerk-tofu-smashed-plantains-with-garlic-ginger-collard-greens", "overview": "This vibrant vegetarian recipe celebrates an array of West Indian flavors. Our tofu, sliced up and coated with jerk seasonings (including cardamom, cinnamon and brown sugar), bakes up to the perfectly crispy and creamy centerpiece. We're serving the tofu over a bed of smashed plantains, infused with coconut and a splash of lime juice. (Keep in mind that your plantains' peels should show some brown or black -  - this level of ripeness is ideal for sweet preparations!)", "calories": 700, "cookTime": 35, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Cod Fillets", "quantity": 4}, {"dimension": "Count", "name": "  Brown Rice", "quantity": 1}, {"dimension": "Ounces", "name": "Gai Lan", "quantity": 10}, {"dimension": "Cloves", "name": "Garlic", "quantity": 3}, {"dimension": "Count", "name": "Scallions", "quantity": 2}, {"dimension": "Tablespoons", "name": "Butter", "quantity": 3}, {"dimension": "Count", "name": " Tablespoons Cashews", "quantity": 3}, {"dimension": "Tablespoons", "name": "Soy Glaze", "quantity": 3}, {"dimension": "Tablespoons", "name": "Rice Vinegar", "quantity": 2}, {"dimension": "Tablespoon", "name": "Star Anise Pods", "quantity": 1}, {"dimension": "Count", "name": "1-Inch Piece Ginger", "quantity": 1}], "steps": [{"index": 1, "text": "In a large pot, combine the rice, 2 cups of water and a big pinch of salt. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 28 to 30 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and add the cashews and half the butter; stir to thoroughly combine and season with salt and pepper to taste. Transfer to a serving dish.", "title": "Make the cashew rice"}, {"index": 2, "text": "While the rice cooks, wash and dry the fresh produce. Peel and mince the garlic and ginger. Cut off and discard the root ends of the scallions. Thinly slice the white bottoms of the scallions; cut the green tops into 1-inch pieces. Cut off and discard the bottom inch of the gai lan stems. To make the glaze, in a medium bowl, combine the vinegar, soy glaze, star anise pods and 1 degrees 4 cup of water.", "title": "Prepare the ingredients"}, {"index": 3, "text": "Once the rice has cooked for about 15 minutes, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the garlic, ginger and white bottoms of the scallions. Cook, stirring frequently, 1 to 2 minutes, or until softened and fragrant. Add the gai lan and 1 degrees 4 cup of water. Cook, stirring frequently, 2 to 4 minutes, or until the gai lan leaves are bright green and wilted. Transfer to a high-sided serving dish and set aside in a warm place. Wipe out the pan.", "title": "Cook the gai lan"}, {"index": 4, "text": "While the rice continues to cook, pat the cod fillets dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the gai lan, heat 1 tablespoon of olive oil on medium until hot. Add the seasoned fillets and cook 2 to 4 minutes on the first side, or until lightly browned. Flip the fillets.", "title": "Start the cod"}, {"index": 5, "text": "Add the glaze to the pan of cod. Cook, occasionally spooning the glaze over the fillets, 1 to 2 minutes, or until the liquid has reduced in volume by about half. Stir in the remaining butter and cook, continuing to spoon the glaze over the fillets, 1 to 2 minutes, or until the cod is thoroughly coated and cooked through. Remove from heat; carefully discard the star anise pods. Transfer the finished cod and glaze to the serving dish of cooked gai lan.", "title": "Finish the cod"}, {"index": 6, "text": "Garnish the cooked gai lan and finished cod and cashew rice with the green tops of the scallions. Enjoy!", "title": "Serve your dish"}], "metadata": {"subtitle": "with Gai Lan and Cashew Brown Rice", "title": "Star Anise and Soy-Glazed Cod", "URL": "https://www.blueapron.com/recipes/soy-star-anise-glazed-fish-with-gai-lan-cashew-brown-rice", "overview": "Star anise is a potent, one-of-a-kind spice. Native to the region encompassing Northeast Vietnam and Southwest China, it's named for its star-like shape, with each point (or pod) cradling a seed. Star anise isn't related to anise, but the two have a similarly strong, licorice-like sweetness. Here, star anise infuses cod and gai lan, or Chinese broccoli, with warming, complex depth. (Chefs, take note: while star anise pods are incredibly flavorful, they're actually inedible. That's why we're discarding them in Step 5. So be careful not to eat them!)", "calories": 515, "cookTime": 40, "servings": 4}}
{"ingredients": [{"dimension": "Ounces", "name": "Roman Rigatoni Pasta", "quantity": 10}, {"dimension": "Count", "name": "28-Ounce Can Whole Peeled Tomatoes", "quantity": 1}, {"dimension": "Pound", "name": "Fresh Mozzarella Cheese", "quantity": 0.5}, {"dimension": "Cloves", "name": "Garlic", "quantity": 4}, {"dimension": "Count", "name": "Radishes", "quantity": 3}, {"dimension": "Count", "name": " Head Butter Lettuce", "quantity": 1}, {"dimension": "Count", "name": "Lemon", "quantity": 1}, {"dimension": "Pound", "name": "Spinach", "quantity": 1}, {"dimension": "Count", "name": "Yellow Onion", "quantity": 1}, {"dimension": "Tablespoons", "name": "Butter", "quantity": 3}, {"dimension": "Cup", "name": "Grated Parmesan Cheese", "quantity": 0.3333333333333333}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Quarter and deseed the lemon. Place the tomatoes in a bowl; gently break apart with your hands. Peel and small dice the onion. Cut off and discard the root end of the lettuce; separate the leaves. Very thinly slice the radishes into rounds. Peel and mince the garlic. Using the flat side of your knife, smash 1 of the minced garlic cloves until it resembles a paste; place in a bowl with the juice of all 4 lemon wedges.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Add the pasta to the pot of boiling water. Cook 8 to 10 minutes, or until just shy of al dente (still slightly firm to the bite). Reserving 1 degrees 2 cup of the pasta cooking water, thoroughly drain the cooked pasta. Set aside in a warm place.", "title": "Cook the pasta"}, {"index": 3, "text": "While the pasta cooks, in a large pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the spinach; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until wilted. Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the cooked spinach to release as much liquid as possible; discard the liquid. Transfer the drained spinach to a cutting board and finely chop. Wipe out the pot.", "title": "Cook and drain the spinach"}, {"index": 4, "text": "While the pasta continues to cook, in the pot used to cook the spinach, heat 1 tablespoon of olive oil on medium-high until hot. Add the minced garlic and onion; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until slightly softened. Add the tomatoes; season with salt and pepper. Cook, stirring occasionally, 14 to 16 minutes, or until slightly reduced in volume. Remove from heat and season with salt and pepper to taste.", "title": "Make the sauce"}, {"index": 5, "text": "Add the cooked pasta, chopped spinach, butter and half the reserved pasta cooking water to the pot of sauce; stir to combine and season with salt and pepper to taste. (If the sauce seems too thick, gradually add the remaining pasta cooking water to achieve your desired consistency.) Transfer to a baking dish. Evenly top with the mozzarella cheese (tearing into bite-sized pieces before adding) and 3 degrees 4 of the Parmesan cheese; season with salt and pepper. Bake 16 to 18 minutes, or until lightly browned on top. Remove from the oven and let stand for 2 minutes before serving.", "title": "Assemble and bake the pasta"}, {"index": 6, "text": "While the pasta bakes, to make the vinaigrette, add the remaining Parmesan cheese to the garlic paste-lemon juice mixture; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. Just before serving, in a large bowl, combine the lettuce and radishes; season with salt and pepper. Add enough of the vinaigrette to coat the salad (you may have extra vinaigrette). Toss to mix and transfer to a serving dish. Serve the baked pasta with the salad on the side. Enjoy!", "title": "Make the salad and serve your dish"}], "metadata": {"subtitle": "with Butter Lettuce and Radish Salad ", "title": "Baked Spinach and Mozzarella Rigatoni", "URL": "https://www.blueapron.com/recipes/baked-spinach-mozzarella-rigatoni-with-radish-butter-lettuce-salad", "overview": "Crispy on top, creamy underneath and undeniably delicious, we love baked pasta in pretty much any form. In this recipe, we're making an elegant and colorful version with Roman rigatoni (a slightly longer type of rigatoni), tomato sauce, spinach, Parmesan and mild, melty mozzarella. On the side, a salad of butter lettuce, crunchy radishes and a garlicky lemon vinaigrette adds notes of citrus to our rich and savory bake.", "calories": 700, "cookTime": 45, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Top Sirloin Steaks", "quantity": 4}, {"dimension": "Cloves", "name": "Garlic", "quantity": 2}, {"dimension": "Count", "name": " Pound Yukon Gold Potatoes", "quantity": 1}, {"dimension": "Bunch", "name": "Kale", "quantity": 1}, {"dimension": "Count", "name": "Lemon", "quantity": 1}, {"dimension": "Tablespoons", "name": "Butter", "quantity": 3}, {"dimension": "Cup", "name": "Grated Parmesan Cheese", "quantity": 0.3333333333333333}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Wash and dry the fresh produce. Medium dice the potatoes. Remove and discard the kale stems; roughly chop the leaves. Peel and mince the garlic. Quarter and deseed the lemon.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Place the potatoes on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer. Roast, stirring halfway through, 24 to 26 minutes, or until lightly browned and tender when pierced with a fork. Remove from the oven and transfer to a serving dish. Set aside in a warm place.", "title": "Roast the potatoes"}, {"index": 3, "text": "While the potatoes roast, in a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the kale (working in batches if necessary) and 1 degrees 2 cup of water; season with salt and pepper. Cook, stirring frequently, 2 to 4 minutes, or until the kale has wilted and the liquid has cooked off. Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the cooked kale to release as much liquid as possible; discard the liquid. Transfer the drained kale to a cutting board and finely chop. Wipe out the pan.", "title": "Cook and drain the kale"}, {"index": 4, "text": "While the potatoes continue to roast, pat the steaks dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the kale, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned steaks and cook 3 to 4 minutes per side for medium-rare, or until browned and cooked to your desired degree of doneness. Transfer to a cutting board, leaving any browned bits (or fond) in the pan, and let rest for at least 5 minutes.", "title": "Cook the steaks"}, {"index": 5, "text": "While the steaks rest, heat the pan of reserved fond on medium until hot. (If the pan seems dry, add 1 teaspoon of olive oil.) Add the garlic and cook, stirring frequently, 30 seconds to 1 minute, or until fragrant. Add the chopped kale, butter and 1 degrees 4 cup of water; season with salt and pepper. Cook, stirring frequently, 3 to 4 minutes, or until thoroughly combined and heated through. Remove from heat and stir in the cheese; season with salt and pepper to taste. Transfer to a serving dish and set aside in a warm place.", "title": "Finish the kale"}, {"index": 6, "text": "Find the lines of muscle (or grain) of the rested steaks; thinly slice crosswise against the grain. Transfer the sliced steaks to a serving dish. Stir any juices from the cutting board into the serving dish of finished kale. Serve with the roasted potatoes and lemon wedges on the side. Enjoy!", "title": "Slice the steaks and serve your dish"}], "metadata": {"subtitle": "with Roasted Potatoes and \"Creamed\" Kale", "title": "Seared Sirloin Steaks", "URL": "https://www.blueapron.com/recipes/seared-sirloin-steaks-with-roasted-potatoes-creamed-kale", "overview": "Chefs, tonight's meal is a master class in hearty steakhouse fare. Our sirloin steaks are simply seasoned with salt and pepper and then pan-seared to perfection. Yukon Gold potatoes, roasted until they're crispy and tender, are an easy and delicious side. We're serving them alongside our take on creamed kale, which we're making with Parmesan, butter and garlic for a rich and robust bite.", "calories": 560, "cookTime": 35, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Pounds Ground Turkey", "quantity": 1.125}, {"dimension": "Count", "name": "Potato Buns", "quantity": 4}, {"dimension": "Pound", "name": "Sweet Potatoes", "quantity": 1}, {"dimension": "Count", "name": " Avocado", "quantity": 1}, {"dimension": "Count", "name": "Lime", "quantity": 1}, {"dimension": "Count", "name": "Red Onion", "quantity": 1}, {"dimension": "Count", "name": " Large Bunch Cilantro", "quantity": 1}, {"dimension": "Count", "name": "  Panko Breadcrumbs", "quantity": 0.3333333333333333}, {"dimension": "Count", "name": "  Mayonnaise", "quantity": 0.3333333333333333}, {"dimension": "Tablespoon", "name": "Mexican Spice Blend (Garlic Powder, Ancho Chile Powder, Smoked Paprika, Ground Cumin and Whole Mexican Oregano)", "quantity": 1}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Wash and dry the fresh produce. Cut the sweet potatoes into 1 degrees 2-inch-thick sticks. Peel and small dice the onion. Halve the buns. Pick the cilantro leaves off the stems; discard the stems. Quarter the lime. Pit, peel and thinly slice the avocado; top with the juice of 2 lime wedges to prevent browning. In a small bowl, combine the mayonnaise and the juice of the remaining lime wedges; season with salt and pepper to taste.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Place the sweet potatoes on a sheet pan. Drizzle with olive oil and season with salt, pepper and 1 degrees 3 of the spice blend; toss to thoroughly coat. Arrange in a single, even layer and roast 18 to 20 minutes, or until browned and tender when pierced with a fork. Remove from the oven and set aside in a warm place.", "title": "Roast the sweet potatoes"}, {"index": 3, "text": "While the sweet potatoes roast, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the onion and remaining spice blend; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened. Transfer to a large bowl and add the ground turkey and breadcrumbs; season with salt and pepper. Gently mix to combine. Using your hands, form the mixture into four 1 degrees 2-inch-thick burgers. Wipe out the pan.", "title": "Cook the onion and form the burgers"}, {"index": 4, "text": "While the sweet potatoes continue to roast, in the pan used to cook the onion, heat 1 tablespoon of olive oil on medium-high until hot. Add the burgers and cook 4 to 6 minutes per side, or until browned and cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan, and set aside in a warm place.", "title": "Cook the burgers"}, {"index": 5, "text": "Heat the pan of reserved fond on medium until hot. (If the pan seems dry, add 1 teaspoon of olive oil.) Working in batches, add the buns, cut sides down. Toast 1 to 2 minutes, or until golden brown. Remove from heat and transfer to a plate.", "title": "Toast the buns"}, {"index": 6, "text": "Spread a thin layer of the lime mayonnaise onto the cut sides of the toasted buns. Top the bun bottoms with the cooked burgers, avocado and as much of the cilantro as you'd like. Complete the burgers with the bun tops. Divide between 4 plates. Serve with the roasted sweet potatoes on the side. Enjoy!", "title": "Assemble the burgers and serve your dish"}], "metadata": {"subtitle": "with Roasted Sweet Potato Fries and Lime Mayonnaise", "title": "Mexican Spiced Turkey Burgers", "URL": "https://www.blueapron.com/recipes/mexican-spiced-turkey-burgers-with-roasted-sweet-potato-fries-lime-mayonnaise", "overview": "Our delicious turkey burgers get their authentic Mexican flavor from a unique spice blend, featuring classic south-of-the-border seasonings. Ancho chile powder, sweet paprika, ground cumin and whole Mexican oregano add distinctive complexity and depth. We're serving the burgers on pillowy potato buns layered with a citrusy lime mayonnaise, creamy avocado and fresh cilantro. A side of roasted sweet potato fries (dusted with the same spices) completes this vibrant meal.", "calories": 700, "cookTime": 30, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Pounds Ground Beef", "quantity": 1.125}, {"dimension": "Count", "name": " Empanada Wrappers", "quantity": 10}, {"dimension": "Count", "name": " 8-Ounce Can Tomato Sauce", "quantity": 1}, {"dimension": "Count", "name": " Ounces Arugula", "quantity": 4}, {"dimension": "Count", "name": " Red Onion", "quantity": 1}, {"dimension": "Count", "name": " Ounces Queso Fresco", "quantity": 2}, {"dimension": "Count", "name": " Tablespoons Red Wine Vinegar", "quantity": 2}, {"dimension": "Count", "name": " Tablespoon Sugar", "quantity": 1}, {"dimension": "Count", "name": "  Sour Cream", "quantity": 0.5}, {"dimension": "Count", "name": "  Dried Apricots", "quantity": 0.25}, {"dimension": "Count", "name": "  Sliced Almonds", "quantity": 0.25}, {"dimension": "Tablespoon", "name": "Fiesta Spice Blend (Smoked Sweet Paprika, Ancho Chile Powder, Ground Cumin, Ground Coriander, Garlic Powder, Mexican Oregano, Cocoa Powder and Ground Cinnamon)", "quantity": 1}], "steps": [{"index": 1, "text": "Preheat the oven to 425 degrees F. Wash and dry the fresh produce. Peel and halve the onion; thinly slice 1 half and small dice the other half. Roughly chop the apricots. Crumble the queso fresco.", "title": "Prepare the ingredients"}, {"index": 2, "text": "In a large, high-sided pan (or pot), heat 1 tablespoon of olive oil on medium-high until hot. Add the ground beef and season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 3 to 5 minutes, or until browned. Carefully drain off and discard the drippings from the pan.", "title": "Brown the beef"}, {"index": 3, "text": "Add the diced onion and spice blend to the pan of beef; season with salt and pepper. Cook on medium-high, stirring occasionally, 1 to 2 minutes, or until the onion is slightly softened. Add the tomato sauce, apricots, almonds and 1 degrees 2 cup of water. Cook, stirring occasionally, 1 to 2 minutes, or until thoroughly combined and the beef is cooked through; season with salt and pepper to taste. Transfer to a bowl. Rinse and wipe out the pan.", "title": "Make the filling"}, {"index": 4, "text": "Lightly oil a sheet pan. Fill a small bowl with water. Place the empanada wrappers on a work surface. Spoon 2 tablespoons of the filling into the center of each wrapper (you may have extra filling). Working 1 at a time, using your fingers, lightly moisten the edges of the wrappers with water; carefully fold the wrappers in half over the filling. Using a fork, firmly press down on the edges to crimp and seal completely. Transfer to the oiled sheet pan. Lightly drizzle the empanadas with olive oil. Bake, rotating halfway through, 16 to 20 minutes, or until golden brown and puffed up. Remove from the oven; let stand for 2 minutes. Transfer to a serving dish.", "title": "Assemble and bake the empanadas"}, {"index": 5, "text": "While the empanadas bake, in the pan used to make the filling, combine the sliced onion, vinegar, sugar and 1 degrees 4 cup of water. Cook on medium, occasionally swirling the pan, 2 to 4 minutes, or until the sugar has dissolved and the liquid is slightly reduced in volume. Transfer to a heatproof bowl and set aside to pickle, stirring occasionally, for at least 10 minutes.", "title": "Pickle the onion"}, {"index": 6, "text": "Just before serving, reserving the pickling liquid, drain the pickled onion. In a large bowl, combine the pickled onion, arugula and queso fresco; season with salt and pepper. Add half the reserved pickling liquid and a drizzle of olive oil. Toss to coat; season with salt and pepper to taste. Transfer to a serving dish. To make the dipping sauce, in a bowl, combine the sour cream and remaining pickling liquid; season with salt and pepper to taste. Serve the baked empanadas and salad with the dipping sauce. Enjoy!", "title": "Finish and serve your dish"}], "metadata": {"subtitle": "with Arugula, Queso Fresco and Pickled Onion Salad", "title": "Baked Empanadas de Picadillo", "URL": "https://www.blueapron.com/recipes/baked-empanadas-de-picadillo-with-arugula-queso-fresco-pickled-onion-salad", "overview": "With origins in Portugal and Northern Spain, empanadas are savory turnovers now enjoyed in a variety of cuisines worldwide. Our baked, Mexican-spiced empanadas de picadillo are savory-sweet and deliciously complex, stuffed with a filling of ground beef, tomato sauce, apricots, almonds and spices. (De picadillo refers to the minced filling.) We're pairing our hearty empanadas with a tangy sour cream dipping sauce and a refreshing salad of arugula tossed with crumbly queso fresco and quick-pickled onion.", "calories": 700, "cookTime": 45, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Boneless, Skinless Chicken Thighs", "quantity": 12}, {"dimension": "Count", "name": "Pocketless Pitas", "quantity": 4}, {"dimension": "Cup", "name": "Greek Yogurt", "quantity": 0.5}, {"dimension": "Cloves", "name": "Garlic", "quantity": 3}, {"dimension": "Count", "name": "Lemon", "quantity": 1}, {"dimension": "Pound", "name": "Russet Potatoes", "quantity": 1}, {"dimension": "Count", "name": " Romaine Heart", "quantity": 1}, {"dimension": "Count", "name": "Red Onion", "quantity": 1}, {"dimension": "Bunch", "name": "Mint", "quantity": 1}, {"dimension": "Tablespoons", "name": "Tahini", "quantity": 2}, {"dimension": "Tablespoons", "name": "Za'atar", "quantity": 2}], "steps": [{"index": 1, "text": "Preheat the oven to 475 degrees F. Wash and dry the fresh produce. Halve the potatoes lengthwise; cut each half into 3 equal-sized wedges. Pick the mint leaves off the stems; discard the stems. Quarter and deseed the lemon. Peel, halve and thinly slice the onion. Peel and mince the garlic. Cut off and discard the root end of the lettuce; thinly slice the leaves crosswise.", "title": "Prepare the ingredients"}, {"index": 2, "text": "Place the potatoes on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange the seasoned potatoes in a single, even layer, skin sides down. Roast 28 to 30 minutes, or until browned and tender when pierced with a fork. Remove from the oven.", "title": "Roast the potatoes"}, {"index": 3, "text": "While the potatoes roast, in a medium bowl, combine the yogurt, tahini, half the mint (tearing just before adding) and the juice of all 4 lemon wedges; season with salt and pepper to taste.", "title": "Make the tahini-yogurt sauce"}, {"index": 4, "text": "While the potatoes continue to roast, pat the chicken dry with paper towels; season with salt, pepper and the za'atar on both sides. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Working in batches, add the seasoned chicken. Cook 4 to 6 minutes per side, or until browned and cooked through. Transfer to a plate and set aside in a warm place, leaving any browned bits (or fond) in the pan. ", "title": "Cook the chicken"}, {"index": 5, "text": "While the potatoes continue to roast, add the garlic and onion to the pan of reserved fond; season with salt and pepper. (If the pan seems dry, add up to 2 teaspoons of olive oil.) Cook on medium-high, stirring frequently and scraping up any fond from the bottom of the pan, 2 to 4 minutes, or until browned and softened. Remove from heat and season with salt and pepper to taste.", "title": "Cook the garlic and onion"}, {"index": 6, "text": "While the garlic and onion cook, carefully place the pitas directly onto the oven rack. Toast 2 to 3 minutes, or until warm and pliable. Remove from the oven and transfer to a serving dish. Transfer the cooked chicken to a cutting board and thinly slice. Divide the lettuce, sliced chicken and cooked garlic and onion between the toasted pitas. Serve with the roasted potatoes and tahini-yogurt sauce on the side. Garnish with the remaining mint. Enjoy!", "title": "Toast the pitas and serve your dish"}], "metadata": {"subtitle": "with Tahini-Yogurt Sauce and Roasted Potato Wedges", "title": "Spiced Chicken Souvlaki", "URL": "https://www.blueapron.com/recipes/spiced-chicken-souvlaki-with-tahini-yogurt-sauce-roasted-potato-wedges", "overview": "Souvlaki, a dish of skewered or shaved meat often served in pita bread, is a delicious Greek favorite. Our chicken souvlaki gets extra flavor from za'atar, a complex Middle Eastern blend of herbaceous and warming spices. On the side, we're roasting hearty potato wedges and making a sauce with yogurt, lemon juice, mint and tahini (a thick paste made from ground sesame seeds). Tahini is a popular ingredient in many Mediterranean dishes, and in our yogurt sauce, it brings the perfect nutty depth to complement the zesty chicken.", "calories": 700, "cookTime": 40, "servings": 4}}
{"ingredients": [{"dimension": "Count", "name": " Boneless, Skinless Chicken Breasts", "quantity": 2}, {"dimension": "Count", "name": " Pound Yukon Gold Potatoes", "quantity": 0.75}, {"dimension": "Pound", "name": "Red Cabbage", "quantity": 0.5}, {"dimension": "Count", "name": " Tablespoons Creme Fraiche", "quantity": 2}, {"dimension": "Count", "name": " Tablespoons Red Wine Vinegar", "quantity": 2}, {"dimension": "Tablespoon", "name": "Chicken Demi-Glace", "quantity": 1}, {"dimension": "Tablespoon", "name": "Butter", "quantity": 1}, {"dimension": "Count", "name": " Tablespoon Sugar", "quantity": 1}, {"dimension": "Count", "name": " Tablespoon Alsatian Spice Blend (All-Purpose Flour and Quatre Épices)", "quantity": 1}], "steps": [{"index": 1, "text": "Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Remove and discard the cabbage core; halve the cabbage crosswise and separate the leaves. Large dice the potatoes.", "title": "Prepare the ingredients"}, {"index": 2, "text": "In a large, high-sided pan, heat 11 degrees 2 cups of water to boiling on high. Add the cabbage; season with salt and pepper. Cook, stirring occasionally, 12 to 14 minutes, or until the cabbage is tender and the water has cooked off. Reduce the heat to medium-high and add the sugar and vinegar; season with salt and pepper. Cook, stirring occasionally to coat the cabbage, 2 to 3 minutes, or until the sugar has dissolved and the liquid is slightly reduced in volume; season with salt and pepper to taste. Transfer to a serving dish and set aside in a warm place. Rinse and wipe out the pan.", "title": "Cook and glaze the cabbage"}, {"index": 3, "text": "While the cabbage cooks, add the potatoes to the pot of boiling water and cook 10 to 12 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot. Off the heat, add the crème fraîche and butter. Using a fork, smash the mixture to your desired consistency; season with salt and pepper to taste. Set aside in a warm place.", "title": "Cook and smash the potatoes"}, {"index": 4, "text": "Place the spice blend on a plate. Pat the chicken dry with paper towels; season with salt and pepper on both sides. Thoroughly coat the seasoned chicken in the spice blend (shaking off any excess). In the pan used to cook the cabbage, heat 2 teaspoons of olive oil on medium-high until hot. Add the coated chicken and cook 3 to 5 minutes per side, or until browned and cooked through.", "title": "Coat and cook the chicken"}, {"index": 5, "text": "Add the demi-glace and 1 degrees 4 cup water to the pan of chicken; season with salt and pepper. Cook, stirring occasionally and spooning the sauce over the chicken, 2 to 3 minutes, or until the sauce is slightly reduced in volume and the chicken is thoroughly coated. Remove from heat; season with salt and pepper to taste. ", "title": "Make the pan sauce and finish the chicken"}, {"index": 6, "text": "Leaving the sauce in the pan, transfer the finished chicken to a cutting board and slice crosswise on an angle. Divide the glazed cabbage, smashed potatoes and sliced chicken between 2 plates. Top the chicken with a few spoonfuls of the pan sauce. Enjoy!", "title": "Plate your dish"}], "metadata": {"subtitle": "with Smashed Potatoes and Glazed Red Cabbage", "title": "Alsatian Spiced Chicken", "URL": "https://www.blueapron.com/recipes/alsatian-spiced-chicken-with-smashed-potatoes-glazed-red-cabbage", "overview": "Alsace, a region of France bordering Germany, distinctively (and deliciously) combines French and German culinary influences. In this Alsatian-style recipe, we're coating our succulent chicken in the classic quatre epices, or four spices: pepper, cloves, nutmeg and ginger. Alongside the chicken, we're serving creamy smashed potatoes, and red cabbage glazed with red wine vinegar for tangy-sweet contrast and plenty of satisfying texture.", "calories": 685, "cookTime": 40, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Top Sirloin Steaks", "quantity": 2}, {"dimension": "Cloves", "name": "Garlic", "quantity": 2}, {"dimension": "Bunch", "name": "Kale", "quantity": 1}, {"dimension": "Pound", "name": "Fingerling Potatoes", "quantity": 0.75}, {"dimension": "Tablespoons", "name": "Creme Fraiche", "quantity": 2}, {"dimension": "Tablespoon", "name": "Butter", "quantity": 1}, {"dimension": "Tablespoon", "name": "Beef Demi-Glace", "quantity": 1}, {"dimension": "Count", "name": " Teaspoon Coarsely Ground Black Pepper", "quantity": 0.5}, {"dimension": "Cup", "name": "Grated Parmesan Cheese", "quantity": 0.25}], "steps": [{"index": 1, "text": "Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Once boiling, add the potatoes and cook 14 to 16 minutes, or until tender when pierced with a fork. Drain thoroughly and set aside to cool slightly. When cool enough to handle, using a paring knife, carefully peel the cooked potatoes; discard the skins. Transfer to a bowl.", "title": "Cook and peel the potatoes"}, {"index": 2, "text": "While the potatoes cook, peel and mince the garlic. Remove and discard the kale stems; finely chop the leaves.", "title": "Prepare the ingredients"}, {"index": 3, "text": "While the potatoes continue to cook, pat the steaks dry with paper towels; season on both sides with salt and half the black pepper (reserving the rest). In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned steaks and cook 2 to 4 minutes per side for medium-rare, or until browned and cooked to your desired degree of doneness. Transfer to a plate, leaving any browned bits (or fond) in the pan. Set the cooked steaks aside to rest for at least 5 minutes.", "title": "Cook the steaks"}, {"index": 4, "text": "Add 2 teaspoons of olive oil to the pan of reserved fond; heat on medium-high until hot. Add the garlic; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant. Add the kale and 1 degrees 4 cup of water; season with salt and pepper. Cook, stirring occasionally and scraping up any fond from the bottom of the pan, 3 to 5 minutes, or until the kale has wilted and the liquid has cooked off. Remove from heat and stir in the cheese; season with salt and pepper to taste. Transfer to a bowl and set aside in a warm place. Rinse and wipe out the pan.", "title": "Cook the kale"}, {"index": 5, "text": "In the pan used to cook the kale, heat 2 teaspoons of olive oil on medium-high until hot. Add the peeled potatoes and cook, stirring occasionally, 6 to 8 minutes, or until crispy and browned on all sides. Transfer to a bowl and set aside in a warm place. Wipe out the pan.", "title": "Brown the potatoes"}, {"index": 6, "text": "Return the rested steaks to the pan. Add the demi-glace, crème fraîche, remaining black pepper and 1 degrees 4 cup of water; cook on medium-high, stirring occasionally, 1 to 2 minutes, or until the sauce is slightly reduced. Add the butter; cook, spooning the sauce over the steaks, 30 seconds to 1 minute. Season with salt and pepper to taste. Transfer the finished steaks to a cutting board; thinly slice against the grain. Divide the cooked kale, browned potatoes and sliced steaks between 2 plates. Top with the pan sauce. Enjoy!", "title": "Finish and plate your dish"}], "metadata": {"subtitle": "with Crispy Fingerling Potatoes and Sautéed Kale", "title": "Steaks au Poivre", "URL": "https://www.blueapron.com/recipes/steak-au-poivre-with-crispy-fingerling-potatoes-sauteed-kale", "overview": "Steak au poivre, or peppered steak, is a French bistro classic. It features steak coated with a layer of cracked peppercorns, then served under a peppercorn cream sauce. We're doing just that in this recipe, making our pan sauce with smooth crème fraîche. And we're completing the steaks with fingerling potatoes - boiled, then browned on the stove until perfectly crisp (a preparation known in French as \"pommes rissolees\") - and a light saute of Parmesan-enriched kale.", "calories": 700, "cookTime": 45, "servings": 2}}
{"ingredients": [{"dimension": "Count", "name": " Pounds Shrimp", "quantity": 1.125}, {"dimension": "Cup", "name": "Jasmine Rice", "quantity": 1}, {"dimension": "Cups", "name": "Coconut Milk", "quantity": 1.75}, {"dimension": "Cloves", "name": "Garlic", "quantity": 3}, {"dimension": "Count", "name": "Lime", "quantity": 1}, {"dimension": "Count", "name": "Red Onion", "quantity": 1}, {"dimension": "Pound", "name": "Spinach", "quantity": 0.5}, {"dimension": "Bunch", "name": "Cilantro", "quantity": 1}, {"dimension": "Count", "name": "1-Inch Piece Ginger", "quantity": 1}, {"dimension": "Count", "name": "  Dried Coconut Flakes", "quantity": 0.25}, {"dimension": "Count", "name": " Tablespoon Shrimp Spice Blend (Garam Masala and Nigella Seeds)", "quantity": 1}], "steps": [{"index": 1, "text": "Wash and dry the fresh produce. Peel and mince the garlic and ginger. Peel and small dice the onion. Pick the cilantro leaves off the stems; discard the stems. Quarter the lime. Pat the shrimp dry with paper towels; place in a bowl. Season the shrimp with salt, pepper and half the spice blend; toss to coat and set aside to marinate. ", "title": "Prepare the ingredients"}, {"index": 2, "text": "In a medium pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the garlic; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened and fragrant. Add the rice, a big pinch of salt and 2 cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork.", "title": "Cook the rice"}, {"index": 3, "text": "While the rice cooks, heat a large, dry, high-sided pan (or pot) on medium until hot. Add the coconut flakes. Cook, stirring occasionally, 3 to 5 minutes, or until golden brown and fragrant. Transfer to a plate. Wipe out the pan.", "title": "Toast the coconut flakes"}, {"index": 4, "text": "While the rice continues to cook, in the pan used to toast the coconut flakes, heat 2 teaspoons of olive oil on medium-high until hot. Add the spinach; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until wilted. Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the cooked spinach to release as much liquid as possible; discard the liquid. Transfer the drained spinach to a cutting board and finely chop. Wipe out the pan.", "title": "Cook and drain the spinach"}, {"index": 5, "text": "While the rice continues to cook, in the pan used to cook the spinach, heat 2 teaspoons of olive oil on medium until hot. Add the onion, ginger and remaining spice blend; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened and fragrant. Add the coconut milk (shaking the can just before opening); season with salt and pepper. Simmer, stirring occasionally, 2 to 3 minutes, or until heated through. (Be careful not to boil the sauce, as the coconut milk may separate.)", "title": "Make the sauce"}, {"index": 6, "text": "Add the marinated shrimp to the pan of sauce; season with salt and pepper. Simmer, stirring occasionally, 4 to 6 minutes, or until the shrimp are opaque and cooked through. Remove from heat and season with salt and pepper to taste. While the shrimp cook, stir the chopped spinach into the pot of cooked rice; season with salt and pepper to taste. Divide the cooked shrimp and sauce and finished rice between 4 bowls. Garnish with the toasted coconut flakes, cilantro and lime wedges. Enjoy!", "title": "Finish and serve your dish"}], "metadata": {"subtitle": "with Garlic-Spinach Rice and Toasted Coconut Flakes", "title": "Garam Masala Shrimp", "URL": "https://www.blueapron.com/recipes/garam-masala-shrimp-with-garlic-spinach-rice-toasted-coconut-flakes", "overview": "The secret to this recipe's delicious depth is the classic Indian spice blend known as garam masala - traditionally a mix of warming and earthy spices like cinnamon, cardamom and peppercorns. Along with peppery nigella seeds, we're using the complex blend to coat shrimp, which we're then cooking in a coconut milk sauce. To accompany these lively flavors, we're infusing rice with sauteed garlic, and then mixing it with cooked spinach, for a gorgeous and flavorful way to soak up the sweet and savory sauce. We're sprinkling toasted coconut flakes on top for irresistible crunch.", "calories": 700, "cookTime": 30, "servings": 4}}
